src/InformationRegisters/кфкИзмененияОбъектовСпецификаций/кфкИзмененияОбъектовСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкИзмененияОбъектовСпецификаций</name>
  <resources>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидИзменений</name>
    <type>
      <types>EnumRef.кфкВидыИзмененияДанных</types>
    </type>
  </resources>
  <resources>
    <name>ВидПовышения</name>
    <type>
      <types>EnumRef.кфкВидыПовышенияВерсий</types>
    </type>
  </resources>
  <attributes>
    <name>БазоваяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.кфкСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.кфкКомпонентСпецификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкВидыИзмененияДанных/кфкВидыИзмененияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкВидыИзмененияДанных</name>
  <enumValues>
    <name>Добавление</name>
  </enumValues>
  <enumValues>
    <name>Изменение</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/кфкИзмененияОбъектовСпецификаций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обработка после записи версий истории данных.
// 
// Параметры:
//	ИнформацияОЗаписиВерсий - КоллекцияИнформацииОЗаписиВерсииИсторииДанных - информация о записи версий
//@skip-check bsl-legacy-check-dynamic-feature-access
Процедура ОбработкаЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий) Экспорт
	
	// Получить объекты, по которым были записаны версии
	Объекты = ОбщегоНазначения.ВыгрузитьКолонку(ИнформацияОЗаписиВерсий, "Данные", Истина);
	Если Объекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем текущие изменения объектов
	ИзмененияОбъектов = ИзмененияОбъектов(Объекты);
	
	// Получаем текущие версии объектов
	ИсторияОбъектов = Новый Соответствие;
	Для Каждого Запись Из ИнформацияОЗаписиВерсий Цикл
		
		// Если версия объекта уже записана, то пропускаем
		История = ИсторияОбъектов.Получить(Запись.Данные); // ИнформацияОЗаписиВерсииИсторииДанных
		Если История <> Неопределено И История.НомерВерсии >= Запись.НомерВерсии Тогда
			Продолжить;
		КонецЕсли;
		
		// Записываем текущую версию объекта
		ИсторияОбъектов.Вставить(Запись.Данные, Запись);
		
	КонецЦикла;
	
	// Если нет новых версий объектов, то пропускаем
	Если ИсторияОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Создаем набор записей регистра сведений
	Набор = СоздатьНаборЗаписей();
	
	ЭлементыСпецификации = ОбщегоНазначения.СкопироватьРекурсивно(Объекты, Ложь);
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияТипаИзМассива(ЭлементыСпецификации, Тип(
		"СправочникСсылка.кфкСпецификации"));
	//@skip-check bsl-legacy-check-string-literal
	СпецификацииОбъектов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ЭлементыСпецификации, "Владелец");
	
	// Получаем различия текущей и базовой версий
	ИндексыПовышения = Перечисления.кфкВидыПовышенияВерсий.Индексы();
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объекты[0]);
	Для Каждого Данные Из Объекты Цикл
		
		// Определяем номер базовой версии объекта
		НомерВерсииДоИзменения = БазоваяВерсияОбъекта(ИзмененияОбъектов, Данные);
		
		// Вычисляем новый индекс повышения версии
		История = ИсторияОбъектов.Получить(Данные); // ИнформацияОЗаписиВерсииИсторииДанных
		Если НомерВерсииДоИзменения > 0 И История.ВидИзмененияДанных <> ВидИзмененияДанных.Удаление Тогда // новый объект
			НомерВерсииПослеИзменения = История.НомерВерсии;
			Изменения = ИсторияДанных.ПолучитьРазличияВерсий(Данные, НомерВерсииПослеИзменения, НомерВерсииДоИзменения);
		Иначе
			Изменения = История;
		КонецЕсли;
		ИндексНовый = Менеджер.ПолучитьВидПовышения(Данные, Изменения, НомерВерсииДоИзменения = 0); // Число
		
		// Определяем текущий индекс повышения версии
		ВидПовышения = ВидПовышенияОбъекта(ИзмененияОбъектов, Данные);
		ИндексТекущий = ?(ЗначениеЗаполнено(ВидПовышения), ИндексыПовышения.Найти(ВидПовышения), -1);
		
		// Если индекс повышения не изменился, то ничего не делаем
		Если ИндексТекущий = ИндексНовый Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Набор.Добавить();
		НоваяСтрока.Спецификация = ?(ТипЗнч(Данные) = Тип("СправочникСсылка.кфкСпецификации"), Данные,
			СпецификацииОбъектов.Получить(Данные));
		НоваяСтрока.Объект = Данные;
		НоваяСтрока.НомерВерсии = История.НомерВерсии;
		НоваяСтрока.ВидИзменений = ВидИзмененийОбъекта(ИзмененияОбъектов, Данные, История.ВидИзмененияДанных);
		НоваяСтрока.ВидПовышения = ИндексыПовышения[ИндексНовый];
		НоваяСтрока.БазоваяВерсия = НомерВерсииДоИзменения;
		
	КонецЦикла;
	
	// Фиксируем изменения
	Если Набор.Количество() > 0 Тогда
		Набор.Записать(РежимЗамещения.Слияние);
	КонецЕсли;
	
КонецПроцедуры

// Удаляет изменения новых объектов, удалённых до фиксации версии.
// 
// Параметры:
//	Спецификация - СправочникСсылка.кфкСпецификации - Спецификация
Процедура УдалитьИзмененияУдаленныхНовинок(Спецификация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Спецификация КАК Спецификация,
		|	Объект КАК Объект
		|ИЗ
		|	РегистрСведений.кфкИзмененияОбъектовСпецификаций КАК кфкИзмененияОбъектовСпецификаций
		|ГДЕ
		|	Спецификация = &Спецификация
		|	И ВидПовышения = ЗНАЧЕНИЕ(Перечисление.кфкВидыИзмененияДанных.Удаление)
		|	И БазоваяВерсия = 0";
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Набор = СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
	КонецЦикла;
	
	Набор.Записать(РежимЗамещения.Удаление);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает изменения объектов спецификации
// 
// Параметры:
//	Объекты - Массив Из СправочникОбъектИмяСправочника - Объекты спецификации
// 
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение - Изменения объектов:
//		* Ключ - СправочникОбъектИмяСправочника - Объект спецификации
//		* Значение - Структура - Изменение объекта:
//			** НомерВерсии - Число - Номер версии объекта
//			** ВидИзменений - ПеречислениеСсылка.кфкВидыИзмененияДанных - Вид изменений объекта
//			** ВидПовышения - ПеречислениеСсылка.кфкВидыПовышенияВерсий - Вид повышения версии объекта
//			** БазоваяВерсия - Число - Базовая версия объекта
//
Функция ИзмененияОбъектов(Объекты)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Объект КАК Объект,
	|	Т.НомерВерсии КАК НомерВерсии,
	|	Т.ВидИзменений КАК ВидИзменений,
	|	Т.ВидПовышения КАК ВидПовышения,
	|	Т.БазоваяВерсия КАК БазоваяВерсия
	|ИЗ
	|	РегистрСведений.кфкИзмененияОбъектовСпецификаций КАК Т
	|ГДЕ
	|	Т.Объект В (&Объекты)";
	
	Запрос.УстановитьПараметр("Объекты", Объекты);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//@skip-check structure-consructor-too-many-keys
		Описание = Новый Структура("НомерВерсии,ВидИзменений,ВидПовышения,БазоваяВерсия");
		ЗаполнитьЗначенияСвойств(Описание, Выборка);
		Результат.Вставить(Выборка.Объект, Описание);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВидПовышенияОбъекта(ИзмененияОбъектов, Объект)
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИзмененияОбъектов.Получить(Объект), "ВидПовышения");
КонецФункции

Функция БазоваяВерсияОбъекта(ИзмененияОбъектов, Объект)
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИзмененияОбъектов.Получить(Объект), "БазоваяВерсия", 0);
КонецФункции

Функция ВидИзмененийОбъекта(ИзмененияОбъектов, Объект, ВидИзменения)
	
	Вид = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИзмененияОбъектов.Получить(Объект), "ВидИзменений");
	Если Вид = Перечисления.кфкВидыИзмененияДанных.Добавление Тогда
		Возврат Вид;
	КонецЕсли;
	
	Если ВидИзменения = ВидИзмененияДанных.Добавление Тогда
		Возврат Перечисления.кфкВидыИзмененияДанных.Добавление;
		
	ИначеЕсли ВидИзменения = ВидИзмененияДанных.Изменение Тогда
		Возврат Перечисления.кфкВидыИзмененияДанных.Изменение;
		
	ИначеЕсли ВидИзменения = ВидИзмененияДанных.Удаление Тогда
		Возврат Перечисления.кфкВидыИзмененияДанных.Удаление;
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестный вид изменения данных'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
